# CLI Tools
brew "bat"
brew "delta"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gsed"
brew "hurl"
brew "jq"
brew "mise"
brew "anomalyco/tap/opencode"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "watch"
brew "zoxide"

# Database Tools
brew "mysql-client"                    # MySQL CLI client (mysql, mysqldump, etc.)
brew "awscli"                          # AWS CLI for DynamoDB and other services

# Python/Jupyter Development
brew "jupyterlab"                      # Jupyter notebooks and lab interface
brew "python-lsp-server"               # Python LSP for editor integration

# Diagramming
brew "mermaid-cli"                     # Mermaid diagram CLI (mmdc command)

# File Sync
brew "rsync"                           # File synchronization (usually pre-installed but ensures latest)
brew "fswatch"                         # File system watcher for auto-sync

# Build dependencies for neovim
brew "cmake"
brew "ninja"
brew "gettext"

# 1Password
cask "1password"                        # Password manager (includes SSH agent)
cask "1password-cli"                    # CLI for secrets automation

# Casks
cask "claude-code"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "github"
cask "ngrok"
