# Taps
tap "homebrew/bundle"

# CLI Tools
brew "eza"
brew "zoxide"
brew "delta"
brew "hurl"
brew "mise"
brew "stow"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "jq"
brew "git"
brew "starship"

# Build dependencies for neovim
brew "cmake"
brew "ninja"
brew "gettext"

# Casks
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
